app/Http/Controllers/FrontendController.php

select * from `categories`
select * from `page_statics`
---
    public function __construct()
    {
        $categories = Category::all();
        $pages = PageStatic::all();