app/Http/Controllers/HomeController.php

select * from `products` where (`pro_hot` = 1 and `pro_active` = 1) limit 50
select * from `articles` where (`a_active` = 1 and `a_hot` = 1) limit 3
select * from `categories` where `c_home` = 1 limit 3
---
    public function index()
    {
        $productHot = Product::where([
            'pro_hot' => Product::HOT_ON,
            'pro_active' =>Product::STATUS_PUBLIC
        ])->limit(50)->get();

        $articleNews = Article::where([
            'a_active' =>Article::STATUS_PUBLIC,
            'a_hot' => Article::HOT
        ])->limit(3)->get();

        $categoriesHome = Category::with('products')
                ->where('c_home',Category::HOME)
                ->limit(3)
                ->get();

select * from `products` where `id` in ('59', '54', '118') order by `id` desc limit 4
---
    public function renderProductView(Request $request)
    {
        if ($request->ajax())
        {
            $listID = $request->id;
            $products = Product::whereIn('id', $listID)->orderBy('id','DESC')->limit(4)->get();