app/Http/Controllers/ShoppingCartController.php

select `pro_name`, `id`, `pro_slug`, `pro_price`, `pro_sale`, `pro_avatar`, `pro_number` from `products` where `products`.`id` = '54' limit 1
---
    public function addProduct(Request $request, $id)
    {
        $product = Product::select('pro_name', 'id', 'pro_slug', 'pro_price', 'pro_sale', 'pro_avatar', 'pro_number')->find($id);